///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//   НастройкиОтчета - см. ВариантыОтчетов.ОписаниеОтчета.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	НастройкиОтчета.Размещение.Удалить(Метаданные.Подсистемы._ДемоОрганайзер.Подсистемы._ДемоРаботаСФайлами);
	НастройкиОтчета.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы(), "Важный");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	НастройкиВарианта.Описание = НСтр("ru = 'Список файлов и их авторов в иерархии папок.';
										|en = 'List of files and their authors in the folder hierarchy.'");
	НастройкиВарианта.НастройкиДляПоиска.КлючевыеСлова =
		НСтр("ru = 'Файловые функции
		|Динамика изменений файлов';
		|en = 'File functions
		|Dynamics of file changes'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПоРазмеру");
	НастройкиВарианта.Описание = НСтр("ru = 'Топ-10 самых больших файлов, отредактированных за указанный период.';
										|en = 'Top 10 of the biggest files edited during the specified period.'");
	НастройкиВарианта.НастройкиДляПоиска.КлючевыеСлова =
		НСтр("ru = 'Топ-10
		|Крупные файлы';
		|en = 'Top 10
		|Large files'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПоТипам");
	НастройкиВарианта.Описание = НСтр("ru = 'Круговая диаграмма использующихся типов файлов.';
										|en = 'Pie chart of used file types.'");
	НастройкиВарианта.НастройкиДляПоиска.КлючевыеСлова =
		НСтр("ru = 'Расширения';
			|en = 'Extensions'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПоВерсиям");
	НастройкиВарианта.Описание = НСтр("ru = 'Список версий, файлов и папок в табличном виде.';
										|en = 'List of versions, files, and folders as a table.'");
	НастройкиВарианта.НастройкиДляПоиска.КлючевыеСлова =
		НСтр("ru = 'Версии
		|Загруженные файлы';
		|en = 'Versions
		|Imported files'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Вспомогательный");
	НастройкиВарианта.Включен = Ложь;
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты._ДемоФайлы) Тогда
		Команда = КомандыОтчетов.Добавить();
		Команда.КлючВарианта      = "ПоВерсиям";
		Команда.ИмяПараметраФормы = "Отбор.Ссылка";
		Команда.Представление     = НСтр("ru = 'Демо: Отчет по версиям';
										|en = 'Demo: Versions report'");
		Команда.Идентификатор     = "_ДемоОтчетПоВерсиям";
		Команда.Важность          = "Важное";
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

// СтандартныеПодсистемы.ПодключаемыеКоманды

// Определяет настройки интеграции отчета с механизмами конфигурации. 
//
// Параметры:
//  НастройкиПрограммногоИнтерфейса - см. ПодключаемыеКоманды.НастройкиПодключаемогоОбъекта
//
Процедура ПриОпределенииНастроек(НастройкиПрограммногоИнтерфейса) Экспорт
	НастройкиПрограммногоИнтерфейса.НастроитьВариантыОтчета = Истина;
	НастройкиПрограммногоИнтерфейса.ОпределитьНастройкиФормы = Истина;
	НастройкиПрограммногоИнтерфейса.ДобавитьКомандыОтчетов = Истина;
	НастройкиПрограммногоИнтерфейса.Размещение.Добавить(Метаданные.Справочники.Файлы);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#КонецЕсли