///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Возвращает результат проверки печати непроведенного документа.
Функция ПечатьРазрешена(СсылкаНаДокумент) Экспорт
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "Проведен") Тогда
		Возврат
			НСтр("ru = 'Печать всех проведенных документов разрешена.
			           |Для проверки выберите непроведенный документ.';
			           |en = 'Printing of all posted documents is allowed.
			           |To check, select an unposted document.'")
	КонецЕсли;
	
	Если УправлениеДоступом.ЕстьРоль("_ДемоПечатьНепроведенныхДокументов", СсылкаНаДокумент) Тогда
		Возврат
			НСтр("ru = 'Печать этого непроведенного документа разрешена, поскольку документ
			           |доступен на чтение (с учетом ограничения на уровне записей) и
			           |в профиль включена роль ""Демо: Печать непроведенных документов"".';
			           |en = 'Printing of this unposted document is allowed, since the document
			           |is available for reading (considering the restriction at the record level), and the ""Demo: Unposted document printing"" role is included
			           |in the profile.'");
	Иначе
		Возврат
			НСтр("ru = 'Печать этого непроведенного документа запрещена, поскольку либо документ
				       |недоступен на чтение (с учетом ограничения на уровне записей), либо
				       |в профиль не включена роль ""Демо: Печать непроведенных документов"".';
				       |en = 'You cannot print this unposted document. This may be because the document
				       |is not available for reading due to RLS restrictions,
				       |or because the profile does not include the ""Demo: Print unposted documents"" role.'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

